85hzc/ask_433/stm32f0/Src/App.c
//手势基准定标，采用平均值定标
void Ges_Calib(void)
{
    uint8_t i;
    uint16_t j,delta;
    uint32_t sum;
    for (i=0;i<GES_CHN_NUM;i++)
    {
        sum=0;
        for (j=0;j<gs.sample_size;j++)
        {
            sum+=gs.ges_sample_array[i][j];
        }
        delta=(uint16_t)(sum/gs.sample_size);
        gs.sample_base[i]=delta;
//      gs.sample_down_limit[i]=SAMPLE_DOWN_LIMIT_DEF+delta;
//      gs.sample_up_limit[i]=SAMPLE_UP_LIMIT_DEF+delta;
        LOG_DEBUG("CHN %d-> base: %d,down_limit: %d,up limit: %d\n",i,gs.sample_base[i],gs.sample_down_limit[i],gs.sample_up_limit[i]);
    }   
}

//归一化采样数组
void Ges_Normalize(void)
{
    uint8_t i,j;
    for (i=0;i<GES_CHN_NUM;i++)
    {
        
        for (j=0;j<gs.sample_size;j++)
        {
            if (gs.ges_sample_array[i][j]>=gs.sample_base[i])
                gs.ges_sample_array[i][j]=gs.ges_sample_array[i][j]-gs.sample_base[i];
            else
                gs.ges_sample_array[i][j]=0;
        }               
    }       
}

////判断是否需要改变sample_size并改变
////返回值：    0-->    不需要改变
////            1-->    需要改变
//uint8_t Ges_SampleSize_Switch(void)
//{
//  uint16_t i;
//  for (i=0;i<gs.sample_size;i++)
//  {
//      
//  }
//}

//打印相关手势信息
void Ges_Log(void)
{
#if (LOG_ENABLE)    
    LOG_DEBUG("this ges-->up: %lld/%d, down_left: %lld/%d, down_right: %lld/%d!\n",
                gs.ges_record[GES_CHN_UP].add_time,gs.ges_record[GES_CHN_UP].ges,
                gs.ges_record[GES_CHN_DOWN_LEFT].add_time,gs.ges_record[GES_CHN_DOWN_LEFT].ges,
                gs.ges_record[GES_CHN_DOWN_RIGHT].add_time,gs.ges_record[GES_CHN_DOWN_RIGHT].ges);
    
    LOG_DEBUG("last ges-->up: %d.%d/%d, down_left: %d.%d/%d, down_right: %d.%d/%d!\n",
                (uint32_t)(gs.last_ges_record[GES_CHN_UP].add_time/1000),(uint32_t)(gs.last_ges_record[GES_CHN_UP].add_time%1000),gs.last_ges_record[GES_CHN_UP].ges,
                (uint32_t)(gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time/1000),(uint32_t)(gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time%1000),gs.last_ges_record[GES_CHN_DOWN_LEFT].ges,
                (uint32_t)(gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time/1000),(uint32_t)(gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time%1000),gs.last_ges_record[GES_CHN_DOWN_RIGHT].ges);  
    LOG_DEBUG("CHN UP         rise_index: %d,peak_index: %d,fall_index: %d\n",gs.wave[GES_CHN_UP].rise_index,gs.wave[GES_CHN_UP].peak_index,gs.wave[GES_CHN_UP].fall_index);
    LOG_DEBUG("CHN DOWN LEFT  rise_index: %d,peak_index: %d,fall_index: %d\n",gs.wave[GES_CHN_DOWN_LEFT].rise_index,gs.wave[GES_CHN_DOWN_LEFT].peak_index,gs.wave[GES_CHN_DOWN_LEFT].fall_index);
    LOG_DEBUG("CHN DOWN RIGHT rise_index: %d,peak_index: %d,fall_index: %d\n",gs.wave[GES_CHN_DOWN_RIGHT].rise_index,gs.wave[GES_CHN_DOWN_RIGHT].peak_index,gs.wave[GES_CHN_DOWN_RIGHT].fall_index);
    LOG_DEBUG("\n");    
    
    uint8_t i,j;
    for (i=0;i<GES_CHN_NUM;i++)
    {
//          LOG_DEBUG("CHN%d raw array: ",i);
//          for (j=0;j<GES_SAMPLE_RAW_ARRAY_NUM;j++)
//          {
//              LOG_DEBUG("%d ",gs.ges_sample_raw_array[i][j]);
//          }
//          LOG_DEBUG("\n");
        if (i==GES_CHN_UP)
            LOG_DEBUG("CHN UP array:         ");
        else if (i==GES_CHN_DOWN_LEFT)
            LOG_DEBUG("CHN DOWN LEFT array:  ");        
        else if (i==GES_CHN_DOWN_RIGHT)
            LOG_DEBUG("CHN DOWN RIGHT array: ");            
        for (j=0;j<gs.sample_size;j++)
        {
            //打印去除基准值的归一化数组
            if (gs.ges_sample_array[i][j]>=gs.sample_down_limit[i])
                LOG_DEBUG("%d ",gs.ges_sample_array[i][j]-gs.sample_down_limit[i]);
            else
                LOG_DEBUG("%d ",0);
//              LOG_DEBUG("%d ",gs.ges_sample_array[i][j]);
        }
        LOG_DEBUG("\n");                
    }
#endif
}

//主任务
void App_Task(void)
{
    static uint8_t calib_num=0;
    /*
    if (gs.sample_start_flag==1)
    {
        gs.sample_start_flag=0;
        VCNL4035_StartGesDetect();
//      LOG_DEBUG("ges detect!\n"); 
    }*/
    //if (gs.sample_ready_flag==1)
    {
        uint16_t ps[3];
        uint8_t res;
        
        gs.sample_ready_flag=0;
        //VCNL4035_ReadPS(ps);
        //VCNL4035_ClearInt();
        getSensorDataByHostout(ps);
        
        res=Ges_Add_Sample(ps);
        //一次数组填充完毕
        if (res==1)
        {
//#if (LOG_ENABLE)
            LOG_DEBUG("sample[%d]",gs.sample_size);
//#endif
            //第一次采样数据作为定标用
            if (!calib_num)
            {
                Ges_Calib();
                calib_num++;
                return;
            }

            res=Ges_Analysis();
            if (res)
            {
                //当前是short采样，改变sample_size继续采样
                if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_S)
                {
                    gs.sample_size=GES_SAMPLE_ARRAY_NUM_L;
                    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_L;
                    gs.ges_sample_raw_cur=GES_SAMPLE_ARRAY_NUM_S;
                    return;
                }
                
                uint64_t tick=Systick_Get();
                
                //上次是HOLD手势,此次不是HOLD且不为空，避免误触发
                if ((gs.last_ges==GES_LEVEL2_HOLD)&&(res!=GES_LEVEL2_HOLD))
                {
                    res=GES_NULL;
                    gs.last_ges=res;
                    gs.last_ges_time=tick;
                    return;
                }   
//              //上次是HOLD手势，此次也是HOLD手势
//              else if ((gs.last_ges==GES_LEVEL2_HOLD)&&(res==GES_LEVEL2_HOLD))
//              {
//                  gs.last_ges=res;
//                  gs.last_ges_time=tick;
////                    return;
//              }
                if (tick>gs.last_ges_time+GES_DISTANCE_MIN)
                {
                    gs.last_ges=res;
                    gs.last_ges_time=tick;
                }
                else
                    return;
                
                if (res==GES_LEVEL2_UP)
                {
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("Ges: UP!");
                    Ges_Log();
                    Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_UP);
                }
                else if (res==GES_LEVEL2_DOWN)
                {
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("Ges: DOWN!");
                    Ges_Log();
                    Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_DOWN);
                }
                else if (res==GES_LEVEL2_LEFT)
                {
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("Ges: LEFT!");
                    Ges_Log();
                    Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_LEFT);
                }
                else if (res==GES_LEVEL2_RIGHT)
                {
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("Ges: RIGHT!");
                    Ges_Log();
                    Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_RIGHT);
                }
                else if (res==GES_LEVEL2_HOLD)
                {
                    static uint8_t sw_state=0;

                    if (gs.hold_counter<SAMPLE_HOLD_COUNT)
                    {
                        gs.hold_counter++;
                        if (gs.hold_counter==SAMPLE_HOLD_COUNT)
                        {
                            Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_HOLD);
                            //led_counter=LED_FLASH_DELAY;
                            LOG_DEBUG("Ges: HOLD!");
                            Ges_Log();
                            if (!sw_state)
                            {
                                //Drv_SERIAL_Rpt(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_UP);
                                sw_state=1;
                            }
                            else
                            {
                                //Drv_SERIAL_Rpt(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_UP);
                                sw_state=0;
                            }
                        }
                    }
                }
                else if (res==GES_LEVEL2_DCLK)
                {
                    Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_FAN, CMD_OP_PWM_RGB), GES_LEVEL2_DCLK);
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("Ges: DCLK!");
                    Ges_Log();
                }
            }
            else
            {
                //当前是long采样，改变sample_size继续采样
                if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
                {
                    gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
                    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
                    return;
                }
                gs.hold_counter=0;
                //HAL_GPIO_WritePin(LED_HOLD_GPIO_Port, LED_HOLD_Pin, GPIO_PIN_RESET);
            }
        }
    }
}

//系统时钟自加
void Systick_Inc(void)
{
    __disable_irq();
    sys_tick++;
    __enable_irq();
}

//获得系统时钟
uint64_t Systick_Get(void)
{
    return sys_tick;
}
